Autodesk.Revit.UI.UIView.GetZoomCorners
Gets the corners of the view's rectangle.
The two points that define the corners of the view's rectangle in model coordinates.
Since:
2013

Autodesk.Revit.UI.UIView.ZoomAndCenterRectangle(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Zoom and center the view to a specified rectangle.
viewCorner1:
A corner of the desired view rectangle in model coordinates.
viewCorner2:
The opposite corner of the desired view rectangle in model coordinates.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.UI.UIView.ZoomSheetSize
Zoom to the sheet size.
Since:
2013

Autodesk.Revit.UI.UIView.Zoom(System.Double)
Zoom the view.
zoomFactor:
Factor by which to zoom in or out. Values greater than 1 zooms in, less than 1 zooms out.
Throws Autodesk.Revit.Exceptions.ArgumentException:
zoomFactor is not positive.
Since:
2013

Autodesk.Revit.UI.UIView.ZoomToFit
Zoom the view to fit its contents.
Since:
2013

Autodesk.Revit.UI.UIView.Close
Closes the view.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot close a project's only open view.
Since:
2013

Autodesk.Revit.UI.UIView.GetWindowRectangle
Gets the rectangle containing the coordinates of the view's drawing area.
Returns:
The rectangle of the view window.
Since:
2013

Autodesk.Revit.UI.UIView.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.UIView.ViewId
The id of the View associated with a UIView.
Since:
2013

Autodesk.Revit.UI.UIView
A class containing data about view windows in the Revit user interface.
Since:
2013